test2-ebs-wl-plain-vs-aesni-10min-2012_03_08_00_32/2012_03_08_00_32/plain-fio.out
plain-write: (g=0): rw=randwrite, bs=16K-16K/16K-16K, ioengine=libaio, iodepth=2
plain-read: (g=0): rw=randread, bs=16K-16K/16K-16K, ioengine=libaio, iodepth=2
fio 2.0.3
Starting 2 processes

plain-write: (groupid=0, jobs=1): err= 0: pid=6704
  write: io=720000KB, bw=1199.1KB/s, iops=74 , runt=600013msec
    slat (usec): min=16 , max=56474 , avg=34.61, stdev=370.77
    clat (usec): min=275 , max=173734 , avg=3076.39, stdev=8498.04
     lat (usec): min=313 , max=173765 , avg=3112.45, stdev=8515.68
    clat percentiles (usec):
     |  1.00th=[  314],  5.00th=[  326], 10.00th=[  342], 20.00th=[  350],
     | 30.00th=[  354], 40.00th=[  358], 50.00th=[  362], 60.00th=[  382],
     | 70.00th=[  684], 80.00th=[ 2832], 90.00th=[ 7008], 95.00th=[17024],
     | 99.00th=[41728], 99.50th=[52480], 99.90th=[86528]
    bw (KB/s)  : min=  813, max= 1609, per=100.00%, avg=1201.09, stdev=67.07
    lat (usec) : 500=65.66%, 750=5.54%, 1000=2.02%
    lat (msec) : 2=4.28%, 4=6.10%, 10=9.32%, 20=2.72%, 50=3.77%
    lat (msec) : 100=0.52%, 250=0.07%
  cpu          : usr=0.07%, sys=0.79%, ctx=86231, majf=0, minf=46
  IO depths    : 1=91.1%, 2=8.9%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=45000/d=0, short=r=0/w=0/d=0
plain-read: (groupid=0, jobs=1): err= 0: pid=6705
  read : io=240016KB, bw=409541 B/s, iops=24 , runt=600125msec
    slat (usec): min=12 , max=9981 , avg=27.48, stdev=116.65
    clat (usec): min=283 , max=183662 , avg=11459.78, stdev=13615.31
     lat (usec): min=309 , max=183689 , avg=11488.67, stdev=13616.63
    clat percentiles (usec):
     |  1.00th=[  298],  5.00th=[ 2288], 10.00th=[ 3440], 20.00th=[ 5024],
     | 30.00th=[ 6368], 40.00th=[ 7584], 50.00th=[ 8640], 60.00th=[ 9792],
     | 70.00th=[10944], 80.00th=[13248], 90.00th=[18816], 95.00th=[30080],
     | 99.00th=[70144], 99.50th=[102912], 99.90th=[150528]
    bw (KB/s)  : min=  231, max=  542, per=100.00%, avg=400.19, stdev=26.37
    lat (usec) : 500=4.14%, 750=0.09%, 1000=0.01%
    lat (msec) : 2=0.35%, 4=8.47%, 10=49.27%, 20=28.57%, 50=6.71%
    lat (msec) : 100=1.88%, 250=0.53%
  cpu          : usr=0.10%, sys=0.19%, ctx=29232, majf=0, minf=53
  IO depths    : 1=94.9%, 2=5.1%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=15001/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=240016KB, aggrb=399KB/s, minb=409KB/s, maxb=409KB/s, mint=600125msec, maxt=600125msec
  WRITE: io=720000KB, aggrb=1199KB/s, minb=1228KB/s, maxb=1228KB/s, mint=600013msec, maxt=600013msec

Disk stats (read/write):
  xvdb: ios=15000/45240, merge=0/119, ticks=172324/143600, in_queue=316198, util=34.52%